/*▄────────────────────────────────▄
  █                                █
  █  Создает контракт уведомлений  █
  █                                █
  ▀────────────────────────────────▀*/
module.exports = class NoticeContract {
/*┌─────────────┐
  │ Конструктор │
  └─────────────┘*/
    constructor(contract) {
    // Инициализируем контракт без сохранения ссылки на основной протокол
        contract(this, { INIT_PROTOCOL: false });
    }
    
/*┌─────────────────────────────────┐
  │ Список информационных сообщений │
  └─────────────────────────────────┘*/
    info = {
    }
    
/*┌───────────────────────┐
  │ Список предупреждений │
  └───────────────────────┘*/
    warn = {
        LANG_NOT_FOUND: 'LANG_NOT_FOUND', // Выбранный язык не найден
    }
    
/*┌───────────────┐
  │ Список ошибок │
  └───────────────┘*/
    error = {
        CHANNEL_NOT_FOUND: 'CHANNEL_NOT_FOUND', // Канал связи не найден
    }
};
