/*▄────────────────────────────────▄
  █                                █
  █  Правило инициализации <NAME>  █
  █                                █
  ▀────────────────────────────────▀*/
module.exports = new class <Name> {
/*
 ┌──────────────────────────────────────┐
 │  Rule как алгоритм сборки            │
 ├──────────────────────────────────────┤
 │                                      │
 │  path     → Где лежит модуль         │
 │  init     → Как его инициализировать │
 │  register → Как встроить в систему   │
 │                                      │
 │  Конвейер Assembly:                  │
 │                                      │
 │      path → init → register          │
 │                                      │
 └──────────────────────────────────────┘
*/
/*┌──────────────────────────┐
  │ Определяет путь к <Name> │
  └──────────────────────────┘*/
    path = (scopePath, unitPath) => {
        return [];
    }
    
/*┌──────────────────────────────────┐
  │ Опции инициализации по умолчанию │
  └──────────────────────────────────┘*/
    defaultOptions = {}
    
/*┌───────────────────────┐
  │ Инициализирует <Name> │
  └───────────────────────┘*/
    init = (parent, current, options) => {}
    
/*┌─────────────────────┐
  │ Регистрирует <Name> │
  └─────────────────────┘*/
    register = (parent, current, scopePath, unitPath) => {}
};
